tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    region0_to_pyrolysisRegion_coupledWall
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  solidRadiation;
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    frontAndBack
    {
        type            cyclic;
    }

    ".*"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}

// ************************************************************************* //
